Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: །དེ་ནས་ནུབ་ཕྱོགས་ན་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་གི་ཕྲེང་བ་ནགས་ཚལ་གྱི་ཕྲེང་བ་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པ་མངོན་པར་མཁྱེན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་མེ་ཏོག་ཙམ་པ་ཀའི་ཁ་དོག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དབང་པོའི་དྲ་བ་ཅན་ཞེས་བྱ་བ་འོད་དེས་བསྐུལ་བས་བྱང་ཆུབ་སེམས་དཔའ་བགྲང་བ་ལས་འདས་པ་དག་གིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ།
en: In the western direction, the light encouraged the bodhisattva, the great being, Indrajālin, who resided in the Campakavarṇā world of the Thus-Gone One Puṣpāvali Vanarāji Kusumitābhijña’s buddha realm.

source: བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ག་ལ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་རིན་པོ་ཆེའི་དྲ་བ་གཅིག་གིས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་གྱི་ཁྱམས་དེ་བཀབ་བོ།
en: Surrounded and escorted by an infinite number of bodhisattvas, he proceeded to the seat of awakening where the Bodhisattva was sitting. As a way to venerate the Bodhisattva, he sheltered the entire area with a single jewel canopy.

source: །དེ་ན་ཕྱོགས་བཅུའི་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དག་ཕན་ཚུན་དུ་འདི་སྐད་འཛེར་ཏེ། འོད་ཀྱི་བཀོད་པ་རྣམ་པ་འདི་ལྟ་བུ་འདི་སུའི་ཡིན་ཞེས་འཛེར་ཏོ། །དེ་ནས་རིན་པོ་ཆེའི་དྲ་བ་དེ་ལས་ཚིགས་སུ་བཅད་པ་འདི་བྱུང་ངོ་།
en: The gods in all directions, together with the nāgas, yakṣas, and gandharvas, said to each other, “Who created this display of light?” At that point, this verse was heard from the jewel canopy:

source: །རིན་ཆེན་འབྱུང་གནས་འཇིག་རྟེན་གསུམ་དགའ་རིན་ཆེན་ཏོག །རིན་ཆེན་དམ་པ་རིན་ཆེན་གྲགས་པ་དེ་ཆོས་དགྱེས།
en: “He is a jewel mine, a jewel banner, and a delight to the three worlds; He is the best of gems, renowned as a jewel, who delights in the true Dharma.

source: །དཀོན་མཆོག་གསུམ་པོ་རྒྱུན་མི་འཆད་པའི་བརྩོན་འགྲུས་བརྙེས།
en: He has the diligence by which he will never be cut off from the Three Jewels;

source: །བྱང་ཆུབ་མཆོག་བརྙེས་འགྱུར་ཏེ་དེ་ཡི་མཆོད་པ་འདི།
en: This is to venerate the One Who Is About to Attain Supreme Awakening.”

source: །དེ་ནས་བྱང་ཕྱོགས་ན་དེ་བཞིན་གཤེགས་པ་ཉི་ཟླ་ཟིལ་དུ་རླག་པར་བྱེད་པའི་འོད་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་ཉི་མ་འཁོར་བར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཀོད་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་འོད་དེས་བསྐུལ་བས་བྱང་ཆུབ་སེམས་དཔའ་བགྲང་བ་ལས་འདས་པ་དག་གིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ།
en: In the northern direction, the light encouraged the bodhisattva, the great being, Vyūharāja, who resided in the Sūryāvartā world of the Thus-Gone One Candra­sūrya­jihmī­kara­prabha’s buddha realm.

source: བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ག་ལ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་ཇི་སྙེད་པ་དེ་སྙེད་འཁོར་གྱི་ཁྱམས་དེར་ཀུན་ཏུ་བསྟན་ཏོ།
en: Surrounded and escorted by an infinite number of bodhisattvas, he proceeded to the seat of awakening where the Bodhisattva was sitting. As a way to venerate the Bodhisattva, he revealed within the courtyard the complete displays of qualities of all buddha realms contained in all the worlds in the ten directions.

source: །དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་ཁ་ཅིག་འདི་སྐད་འཛེར་ཏེ། བཀོད་པ་རྣམ་པ་འདི་ལྟ་བུ་འདི་སུའི་ཡིན་ཞེས་འཛེར་ཏོ། །དེ་ནས་བཀོད་པ་དེ་དག་ཐམས་ཅད་ལས་ཚིགས་སུ་བཅད་པ་འདི་བྱུང་ངོ་།
en: Seeing this, some bodhisattvas asked each other, “Who created such displays?” At that point, this verse was heard from each of the displays:

source: །གང་གིས་བསོད་ནམས་ཡེ་ཤེས་ཤིན་ཏུ་མང་པོས་ལུས་ནི་རྣམ་སྦྱངས་ཤིང་།
en: “The enormity of his merit and wisdom has purified his body;

source: །གང་གིས་བརྟུལ་ཞུགས་དཀའ་ཐུབ་དག་དང་བདེན་པའི་ཆོས་ཀྱིས་ངག་སྦྱངས་ལ།
en: His disciplined action, austerities, and truthful Dharma have purified his speech;

source: །གང་གིས་ཁྲེལ་ཡོད་མོས་པ་བྱམས་དང་དེ་བཞིན་སྙིང་རྗེས་སེམས་སྦྱངས་པ།
en: His conscientiousness, devotion, love, and compassion have purified his mind.

source: །དེ་ནི་ཤིང་རྒྱལ་དྲུང་གཤེགས་ཤཱཀྱ་ཁྱུ་མཆོག་དེ་ལ་མཆོད་པ་བྱེད།
en: This is to venerate him, the Leader of the Śākyas, who has gone to the king of trees.”

source: །དེ་ནས་ཤར་ལྷོའི་ཕྱོགས་མཚམས་ན་དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་གྱི་རྒྱལ་པོ་སྣང་བའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་ཡོན་ཏན་གྱི་འབྱུང་གནས་སུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོན་ཏན་གྱི་བློ་གྲོས་ཞེས་བྱ་བ་འོད་དེས་བསྐུལ་བས་བྱང་ཆུབ་སེམས་དཔའ་བགྲང་བ་ལས་འདས་པ་དག་གིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ།
en: In the southeastern direction, the light encouraged the bodhisattva, the great being, Guṇamati, who resided in the Guṇākarā world of the Thus-Gone One Guṇa­rāja­prabhāsa’s buddha realm.

source: བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ག་ལ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ག་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Surrounded and escorted by an infinite number of bodhisattvas, he proceeded to the seat of awakening where the Bodhisattva was sitting.

source: བྱང་ཆུབ་སེམས་དཔའ་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་འཁོར་གྱི་ཁྱམས་དེར་ཡོན་ཏན་གྱི་བཀོད་པ་ཐམས་ཅད་དང་ལྡན་པའི་ཁང་པ་བརྩེགས་པ་མངོན་པར་སྤྲུལ་ཏེ་ཁང་པ་བརྩེགས་པ་དེ་ལས་ཚིགས་སུ་བཅད་པ་འདི་བྱུང་ངོ་།
en: As a way to venerate the Bodhisattva, he miraculously emanated within the sacred area a multistoried palace endowed with all perfect qualities. The members of Guṇamati’s retinue asked, “Who has created such a display?” The multistoried palace then resounded with this verse: “It is merely a trace of his qualities

source: །གང་གི་ཡོན་ཏན་དག་གིས་ལྷ་དང་ལྷ་མིན་དང་། །གནོད་སྦྱིན་ལྟོ་འཕྱེ་ཆེ་དག་རྟག་ཏུ་ཡོན་ཏན་བགོས།
en: That the gods, demigods, yakṣas, and mahoragas will ever possess.

source: །ཡོན་ཏན་ཅན་དེ་ཡོན་ཏན་ལྡན་པའི་རྒྱལ་རིགས་སྐྱེས།
en: With such traits he was born into a royal family of many qualities.

source: །ཡོན་ཏན་རྒྱ་མཚོ་བྱང་ཆུབ་ཤིང་གི་དྲུང་ན་བཞུགས།
en: Now this Ocean of Qualities sits under the branches of the Bodhi tree.”

source: །དེ་ནས་ལྷོ་ནུབ་ཀྱི་ཕྱོགས་མཚམས་ན་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་སྲོག་ཤིང་གི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་འབྱུང་བར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རིན་པོ་ཆེ་འབྱུང་བ་ཞེས་བྱ་བ་འོད་དེས་བསྐུལ་བས་བྱང་ཆུབ་སེམས་དཔའ་བགྲང་བ་ལས་འདས་པ་དག་གིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ།
en: Then, in the southwestern direction, the light encouraged the bodhisattva, the great being Ratnasambhava, who resided in the Ratnasambhava world of the Thus-Gone One Ratnayaṣti’s buddha realm.

source: བྱང་ཆུབ་སེམས་དཔའ་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་འཁོར་གྱི་ཁྱམས་དེར་རིན་པོ་ཆེའི་མཁའ་རྟེན་གྲངས་མེད་དཔག་ཏུ་མེད་པ་མངོན་པར་སྤྲུལ་ཏེ།
en: As a way to venerate the Bodhisattva, he emanated within the sacred area a limitless and boundless number of pavilions made of precious stones.

source: རིན་པོ་ཆེའི་མཁའ་རྟེན་དེ་དག་ལས་ཚིགས་སུ་བཅད་པ་འདི་བྱུང་ངོ་།
en: Then from these celestial pavilions, this verse was heard:

source: །གང་གིས་རྒྱ་མཚོར་བཅས་པའི་ས་དང་དེ་བཞིན་རིན་ཆེན་རྣམ་དག་དང་། །ཁང་བཟངས་སྐར་ཁུང་བསིལ་ཁང་མཆོག་དང་ཟུང་དང་བཞོན་པ་མཁའ་རྟེན་བརྒྱན།
en: “He who has renounced the ocean and the land along with all precious objects, Who abandoned his palace with its fine oval windows and terraces, and also his harnessed carriages,

source: །མེ་ཏོག་ཕྲེང་བ་མཛེས་དང་འདུན་ས་དག་དང་སྐྱེད་མོས་ཚལ་རྣམས་དང་། །རྐང་པ་ལག་པ་མགོ་དང་མིག་བཏང་བ་དེ་བྱང་ཆུབ་སྙིང་པོར་འདུག །དེ་ནས་ནུབ་བྱང་གི་ཕྱོགས་མཚམས་ན་དེ་བཞིན་གཤེགས་པ་འབྲུག་སྒྲ་རྒྱལ་པོའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་སྤྲིན་དང་ལྡན་པར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྲིན་བརྩེགས་འབྲུག་བསྒྲགས་དབྱངས་ཞེས་བྱ་བ་འོད་དེས་བསྐུལ་བས་བྱང་ཆུབ་སེམས་དཔའ་བགྲང་བ་ལས་འདས་པ་དག་གིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ།
en: Ornate pavilions, exquisite flowers and garlands, parks, wellsprings, and assembly halls, Giving up his feet, hands, head, and eyes—he now sits at the seat of awakening.” Then, in the northwestern direction, the light encouraged the bodhisattva, the great being, Megha­kūṭābhigarjitasvara, who resided in the Meghavatī world of the Thus-Gone One Megharāja’s buddha realm.

source: བྱང་ཆུབ་སེམས་དཔའ་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་དུས་ཀྱི་རྗེས་སུ་འབྲང་བའི་ཨ་ག་རུའི་སྤྲིན་མངོན་པར་སྤྲུལ་ཏེ་འཁོར་གྱི་ཁྱམས་དེར་ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོའི་ཕྱེ་མའི་ཆར་མངོན་པར་ཕབ་བོ།
en: As a way to venerate the Bodhisattva, he manifested a cloud of gum benjamin and aloeswood above the sacred area and caused a rain of sandalwood dust to fall.

source: །དུས་ཀྱི་རྗེས་སུ་འབྲང་བའི་སྤྲིན་གྱི་དཀྱིལ་འཁོར་དེ་ལས་ཀྱང་ཚིགས་སུ་བཅད་པ་འདི་བྱུང་ངོ་།
en: The cloud then resounded with this verse:

source: །རིག་དང་རྣམ་པར་གྲོལ་བའི་འོད་ཀྱི་ཆོས་ཀྱི་སྤྲིན་གྱིས་སྲིད་གསུམ་ཐམས་ཅད་ཁྱབ།
en: “He, shining with the light of confidence in knowledge, spreads the cloud of Dharma all throughout the three realms;

source: །དམ་ཆོས་འདོད་ཆགས་བྲལ་བ་བདུད་རྩི་མྱ་ངན་འདས་པ་ཐོབ་བྱེད་ཆར་པ་འབེབས།
en: He, free from attachment, makes the sacred Dharma—the nectar that takes beings beyond suffering—fall like rain.

source: །འདོད་ཆགས་ཉོན་མོངས་འཆིང་བའི་འཁྲི་ཤིང་ཐམས་ཅད་བག་ཆགས་བཅས་ཏེ་གཅོད་པར་འགྱུར།
en: He will cut the fettering vines of attachment and negative emotions, along with their habitual tendencies,

source: །བསམ་གཏན་རྫུ་འཕྲུལ་སྟོབས་དང་དབང་པོའི་མེ་ཏོག་རྒྱས་པ་དད་པར་བྱེད་པ་འབྱིན།
en: And blossoming forth with concentration, miracles, powers, and strengths, he will grant to beings a fount of faith.”

source: །དེ་ནས་བྱང་ཤར་གྱི་ཕྱོགས་མཚམས་ན་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་གདུགས་མངོན་པར་འཕགས་པ་སྣང་བའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་གསེར་གྱི་དྲ་བས་ཁེབས་པ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གསེར་གྱི་དྲ་བས་བརྒྱན་པ་ཞེས་བྱ་བ་འོད་དེས་བསྐུལ་བས་བྱང་ཆུབ་སེམས་དཔའ་བགྲང་བ་ལས་འདས་པ་དག་གིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ།
en: Then, in the northeastern direction, the light encouraged the bodhisattva, the great being, Hema­jālālaṃkṛta, who resided in the Hema­jāla­pratichannā world of the Thus-Gone One Ratnacchatrābhyudgatāvabhāsa’s buddha realm. Surrounded and escorted by an infinite number of bodhisattvas, he proceeded to the seat of awakening where the Bodhisattva was sitting.

source: བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ག་ལ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་ཁང་པ་བརྩེགས་པ་དེ་དག་ཐམས་ཅད་དང་། རིན་པོ་ཆེའི་མཁའ་རྟེན་རྣམས་སུ་བྱང་ཆུབ་སེམས་དཔའི་གཟུགས་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་ལེགས་པར་བརྒྱན་པ་དག་མངོན་པར་སྤྲུལ་ཏེ།
en: As a way to venerate the Bodhisattva, he emanated appearances of bodhisattvas, each adorned with the thirty-two marks, on each of the palaces and pavilions.

source: བྱང་ཆུབ་སེམས་དཔའི་གཟུགས་དེ་དག་ཐམས་ཅད་ཀྱང་ལྷ་དང་མིའི་མེ་ཏོག་གི་ཕྲེང་བ་ཐོགས་ཤིང་བྱང་ཆུབ་སེམས་དཔའ་ག་ལ་བ་དེ་ལོགས་སུ་ལུས་བཏུད་ནས་མེ་ཏོག་གི་ཕྲེང་བ་སྤྱངས་ཏེ་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ།
en: Each of these manifestations of bodhisattvas held up flower garlands from both the human and divine realms. They all bowed to the Bodhisattva and, as they offered the flower garlands, they sang this verse:

source: །གང་གིས་སངས་རྒྱས་ཁྲག་ཁྲིག་སྔོན་བསྟོད་ཅིང་།
en: “Who praised a million buddhas

source: །གུས་དང་བཅས་པས་དད་པ་ཆེ་བསྐྱེད་ལ།
en: And respectfully developed great faith?

source: །ཚངས་པའི་སྒྲ་དབྱངས་སྙན་པའི་ཚིག་སྨྲས་པ།
en: Who speaks with a beautiful voice, like the melody of Brahmā?

source: །བྱང་ཆུབ་སྙིང་པོར་བྱོན་ལ་མགོས་ཕྱག་འཚལ།
en: To him, who now has arrived at the seat of awakening, I bow.”

source: །དེ་ནས་འོག་གི་ཕྱོགས་ན་དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་གཟིགས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་ཀུན་ཏུ་རྣམ་པར་བལྟས་པར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རིན་པོ་ཆེའི་སྙིང་པོ་ཞེས་བྱ་བ་འོད་དེས་བསྐུལ་བས་བྱང་ཆུབ་སེམས་དཔའ་བགྲང་བ་ལས་འདས་པ་དག་གིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ།
en: In the quarter down below, the light encouraged the bodhisattva, the great being, Ratnagarbha, who resided in the Samanta­vilokitā world of the Thus-Gone One Samantadarśin’s buddha realm. Surrounded and escorted by an infinite number of bodhisattvas, he proceeded to the seat of awakening where the Bodhisattva was sitting.

source: བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ག་ལ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་བཻ་དཱུརྱའི་འཁོར་གྱི་ཁྱམས་དེར་འཛམ་བུའི་གླིང་གི་གསེར་གྱི་པད་མ་རྣམས་མངོན་དུ་བྱུང་བར་བསྟན་ཏོ།
en: As a way to venerate the Bodhisattva, he displayed lotuses made of gold from the Jambū River within the beryl maṇḍala.

source: །པད་མ་དེ་དག་གི་སྙིང་པོ་ལ་བུད་མེད་ལུས་ཕྱེད་སྣང་བ། ཁ་དོག་དང་གཟུགས་ཕུན་སུམ་ཚོགས་པ། རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་བསྟན་ཏེ།
en: At the center of the lotuses, one could see the upper body of many women, in perfect shape and appearance and adorned with various jewelry.

source: ལག་པ་གཡས་གཡོན་ན་མགུལ་གདུབ་དང་། གདུ་བུ་དང་། དཔུང་རྒྱན་དང་། གསེར་སྐུད་དང་། མུ་ཏིག་གི་དོ་ཤལ་ལ་སོགས་པ་རྒྱན་རྣམ་པ་མང་པོ་ཐོགས་ཤིང་མེ་ཏོག་དང་དར་གྱི་ལྡ་ལྡི་སྤྱངས་ནས་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ག་ལ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ག་ལ་བ་དེ་ལོགས་སུ་ལུས་བཏུད་དེ་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ།
en: In their hands they proffered many types of jewelry, such as necklaces, bracelets, armbands, gold threads, and pearl necklaces. As they offered these along with flower garlands and silken tassels, they bowed in the direction of the seat of awakening and the Bodhisattva, and sang this verse:

source: །གང་ཞིག་རྟག་ཏུ་སངས་རྒྱས་ཉན་ཐོས་དང་། །རང་རྒྱལ་དག་དང་བླ་མ་རྣམས་ལ་འདུད།
en: “He always bowed to the buddhas, the hearers, The solitary buddhas, and his masters.

source: །ཁྲིམས་ལྡན་རྟག་དྲན་དགའ་ལ་ང་རྒྱལ་མེད།
en: Disciplined, mindful, joyful, and without pride,

source: །ཡོན་ཏན་ལྡན་པ་དེ་ལ་འདུད་པ་བྱོས།
en: To him, who is full of qualities, you should bow down!”

source: །དེ་ནས་སྟེང་གི་ཕྱོགས་ན་དེ་བཞིན་གཤེགས་པ་ཚོགས་ཀྱི་དབང་པོའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་ཚོགས་ཀྱི་དམ་པར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནམ་མཁའ་མཛོད་ཅེས་བྱ་བ་འོད་དེས་བསྐུལ་བས་བྱང་ཆུབ་སེམས་དཔའ་བགྲང་བ་ལས་འདས་པ་དག་གིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ།
en: In the quarter above, the light encouraged the bodhisattva, the great being, Gagaṇagañja, who resided in the Varagaṇā world of the Thus-Gone One Gaṇendra’s buddha realm.

source: བྱང་ཆུབ་སེམས་དཔའ་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་ནམ་མཁའི་དཀྱིལ་ན་འདུག་བཞིན་དུ་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ན་སྔོན་མ་མཐོང་མ་ཐོས་པའི་མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། བདུག་སྤོས་དང་། གོས་དང་། རྒྱན་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། རྣམ་པར་རྒྱལ་བའི་ཁང་པ་དང་། རིན་པོ་ཆེ་དང་། ནོར་བུ་དང་། གསེར་དང་། དངུལ་དང་། མུ་ཏིག་དང་། རྟ་དང་། གླང་པོ་ཆེ་དང་། ཤིང་རྟ་དང་། དཔུང་བུ་ཆུང་དང་། བཞོན་པ་དང་། ཤིང་ལྗོན་པ་དང་། ལོ་མ་དང་། མེ་ཏོག་དང་། འབྲས་བུ་དང་། ཁྱེའུ་དང་། བུ་མོ་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དང་། མི་དང་། མི་མ་ཡིན་པ་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཐམས་ཅད་ནམ་མཁའི་དཀྱིལ་ནས་ཆར་ཆེན་པོ་མངོན་པར་ཕབ་སྟེ།
en: As a way to venerate the Bodhisattva, he stood in the middle of the sky and brought down a rain of objects never before seen or heard of in any of the buddha realms in the ten directions. It rained down many types of flowers, incense, perfumes, flower garlands, ointments, powders, cloths, ornaments, parasols, banners, streamers, banners of victory, jewels, precious stones, gold, silver, pearls, horses, elephants, chariots, infantrymen, carriages, flowering trees, leaves, fruits, boys, girls, gods, nāgas, yakṣas, gandharvas, demigods, garuḍas, kinnaras, mahoragas, Indra, Brahmā, the world protectors, humans, and nonhumans.

source: ཐམས་ཅད་དགའ་བ་དང་། བདེ་བ་སྐྱེད་ཀྱི་སེམས་ཅན་གང་ལ་ཡང་འཇིགས་པའམ་གནོད་པར་མི་བྱེད་དོ།
en: Everyone felt full of joy and happiness, and no one made anyone afraid or caused anyone harm.

source: །དེ་བཞིན་དུ་སྦྱར་ཏེ་དེ་ལ་འདི་སྐད་ཅེས་བྱའོ།
en: This can also be expressed in verse:

source: །ཕྱོགས་བཅུ་དེ་དག་རྣམས་ནས་རྒྱལ་བའི་སྲས་པོ་གང་།
en: In brief, the offspring of the victorious ones from the ten directions

source: །ཕན་པར་བྱེད་པ་མཆོད་པར་བྱང་ཆུབ་ལྷགས་གྱུར་པ།
en: Arrive to pay homage to the benefactor who has attained awakening.

source: །འགྲོ་ལ་ཕན་པ་དེ་དག་རྣམས་ཀྱི་བཀོད་རིམ་དང་། །རྩལ་དང་རིམ་པ་མཛེས་པ་དག་གི་དཔེ་ཙམ་ཉོན།
en: You will hear only an approximate account of the displays of these bodhisattvas, The bodhisattvas possessed of strength and beauty.

source: །ཁ་ཅིག་དོ་ཤལ་ཁྲག་ཁྲིག་རབ་ཏུ་སྤྱངས་བྱས་ཏེ།
en: Some offer a million necklaces;

source: །ནམ་མཁའ་ལས་ནི་འབྲུག་ལྟར་ཤིན་ཏུ་སྒྲོགས་ཤིང་ལྷགས།
en: They arrive in the sky, loud like thunder.

source: །ཁ་ཅིག་མཁའ་ལས་མེ་ཏོག་གཞལ་མེད་ཁང་སྟོན་ཅིང་།
en: Some display flowers and palaces in the expanse of space;

source: །ཅོད་པན་རིན་ཆེན་ཐོགས་ལ་གཙུག་ཕུད་འཕྱང་ཞིང་ལྷགས།
en: They arrive with jewel diadems adorning their hair.

source: །ཁ་ཅིག་སྟོང་པ་མཚན་མེད་སྨོན་མེད་མཆོག་བརྗོད་ཅིང་།
en: Some proclaim emptiness, signlessness, and wishlessness;

source: །ས་ལས་སེང་གེ་ལྟ་བུར་ཤིན་ཏུ་སྒྲོགས་ཤིང་ལྷགས།
en: As they arrive on the ground, they roar like lions.

source: །ཁ་ཅིག་སྔོན་ཆད་མ་མཐོང་མེ་ཏོག་མཛེས་འཐོར་ཞིང་།
en: Some scatter beautiful flowers never seen before;

source: །ཁྱུ་མཆོག་ཅི་འདྲ་དེ་འདྲར་ཤིན་ཏུ་སྒྲོགས་ཤིང་ལྷགས།
en: As they arrive, they roar like bulls.

source: །ཁ་ཅིག་རང་གི་ལུས་ཀྱི་ཁ་དོག་སྟོང་སྟོན་ཅིང་།
en: Some reveal their bodies in a thousand colors;

source: །རྨ་བྱ་ལྟ་བུར་མཁའ་ལས་ཤིན་ཏུ་སྒྲོགས་ཤིང་ལྷགས།
en: As they arrive in space, they cry like peacocks.

source: །ཁ་ཅིག་བདེ་གཤེགས་སྲས་ཀྱི་ཡོན་ཏན་ཕྲེང་བརྗོད་ཅིང་།
en: Some proclaim the garlands of qualities of the son of the Well-Gone Ones;

source: །ཟླ་བ་ལྟ་བུར་མཁའ་ལས་ཤིན་ཏུ་རྒྱས་ཤིང་ལྷགས།
en: As they arrive in space, they are like the full moon.

source: །ཁ་ཅིག་ཉི་མ་ལྟ་བུར་འོད་ཟེར་རབ་འགྱེད་དེ།
en: Some, like the sun, send forth rays of light;

source: །བདུད་ཀྱི་གནས་རྣམས་ཐམས་ཅད་མོག་མོག་བྱེད་ཅིང་ལྷགས།
en: As they arrive, they make all the abodes of Māra appear dark.

source: །བསོད་ནམས་ཚོགས་བསགས་ཁ་ཅིག་དབང་པོའི་མཆོད་སྡོང་འདྲའི།
en: Some who have gathered the accumulation of merit

source: །དྲི་མེད་ཏོག་ཐོགས་བྱང་ཆུབ་སྙིང་པོ་དེར་ཡང་ལྷགས།
en: Arrive at the seat of awakening, bright as rainbows.

source: །ཁ་ཅིག་མཁའ་ལས་ནོར་བུ་རིན་ཆེན་དྲ་བ་འཐོར།
en: Some scatter a lattice of precious stones from the sky,

source: །ཟླ་བ་ཟླ་བཟངས་ཐང་སྐྱེས་རྣམ་མཛེས་མན་དཱ་ར།
en: Shining like the beautiful new moon.

source: །པར་ཤ་ཙམ་པ་ཀ་དང་སྣ་མའི་མེ་ཏོག་ཕྲེང་།
en: They throw māndārava flowers and garlands of campaka flowers

source: །བྱང་ཆུབ་སེམས་དཔའ་ཤིང་རྒྱལ་དྲུང་ན་བཞུགས་ལ་འཐོར།
en: Toward the Bodhisattva as he sits at the foot of the king of trees.

source: །ཁ་ཅིག་རྐང་པ་གཉིས་ཀྱིས་ས་ནི་རབ་བསྐྱོད་ལ།
en: Some arrive, making the earth shake with their two feet;

source: །ས་བསྐྱོད་ནས་ཀྱང་སྐྱེ་བོ་དགའ་བར་བྱེད་ཅིང་ལྷགས།
en: The shaking ground amuses the people.

source: །ཁ་ཅིག་རི་བོ་ལྷུན་པོ་ལག་ན་ཐོགས་བྱེད་ལ།
en: Some proffer the central mountain on the palms of their hands

source: །བར་སྣང་གནས་ཏེ་མེ་ཏོག་སྐོན་བུ་འཐོར་ཞིང་ལྷགས།
en: As they remain in midair, scattering flowers from baskets.

source: །ཁ་ཅིག་རྒྱ་མཚོ་བཞི་པོ་མགོ་ལ་ཐོགས་ནས་ནི།
en: Some bring the four oceans on top of their heads;

source: །ས་ལ་སྤོས་ཆུ་འཐོར་ཏེ་ཆག་ཆག་འདེབས་ཤིང་ལྷགས།
en: As they arrive, they scatter and sprinkle perfume on the ground.

source: །ཁ་ཅིག་རིན་ཆེན་མཆོད་སྡོང་སྣ་ཚོགས་ཐོགས་ནས་ནི།
en: Some hold up various jewel staffs;

source: །རྒྱང་རིང་འདུག་སྟེ་བྱང་ཆུབ་སེམས་དཔའ་སྟོན་ཅིང་ལྷགས།
en: As they arrive, they point out the Bodhisattva from afar.

source: །ཁ་ཅིག་ཚངས་པ་ལྟ་བུར་ཞི་བའི་གཟུགས་བསྒྱུར་ཏེ།
en: Some, like Brahmā, have peaceful forms;

source: །ཡིད་ཞི་རབ་ཞི་གནས་ཤིང་བསམ་གཏན་བསམ་གཏན་པ།
en: Their peaceful minds rest calmly and their concentration is firm.

source: །དེ་དག་བ་སྤུ་དག་ལས་བྱམས་དང་སྙིང་རྗེ་དང་། །དགའ་དང་བཏང་སྙོམས་ཚད་མེད་ཡིད་འོང་སྒྲ་འབྱིན་ལྷགས།
en: As they arrive, the pores of their bodies resonate with the beautiful sounds Of limitless love, compassion, joy, and equanimity.

source: །ཁ་ཅིག་བརྒྱ་བྱིན་ལྷ་ལྟར་སྟོང་ཕྲག་ཁྲག་ཁྲིག་གི །
en: Some arrive like the god Indra;

source: ལྷ་རྣམས་དག་གིས་མདུན་དུ་བདར་ནས་ལྷགས་གྱུར་ཅིང་།
en: They come surrounded by millions of gods.

source: །དེ་དག་བྱང་ཆུབ་ཤིང་དྲུང་ཕྱིན་ནས་ཐལ་སྦྱར་ཏེ།
en: At the Bodhi tree they join their palms

source: །བརྒྱ་བྱིན་ཐོགས་པའི་ནོར་བུ་རིན་ཆེན་སྣ་ཚོགས་འཐོར།
en: And scatter jewels like the ones possessed by Indra.

source: །ཁ་ཅིག་ཕྱོགས་བཞི་དག་གི་སྐྱོང་བ་ཇི་ལྟ་བར།
en: Some arrive like the guardians of the four directions,

source: །དྲི་ཟ་སྲིན་པོ་མིའམ་ཅི་ཡིས་ཡོངས་བསྐོར་ཏེ།
en: Surrounded by gandharvas, rākṣasas, and kinnaras.

source: །གློག་ལྟར་གསལ་བའི་མེ་ཏོག་ཆར་པ་འབེབས་ཤིང་ལྷགས།
en: Like lightning, they bring down a rain of luminous flowers,

source: །དྲི་ཟ་མིའམ་ཅི་ཡི་སྐད་ཀྱིས་བརྟན་པ་བསྟོད།
en: And praise the heroic one with the voice of gandharvas and kinnaras.

source: །ཁ་ཅིག་མེ་ཏོག་རྒྱས་པའི་ལྗོན་ཤིང་འབྲས་བུར་བཅས།
en: Some arrive with heavenly trees in bloom,

source: །མེ་ཏོག་བཅས་ཤིང་མཆོག་གི་དྲི་ནི་རབ་འབྱིན་ལ།
en: With fruits, flowers, and perfect scents.

source: །ལོ་མར་སངས་རྒྱས་སྲས་པོ་ལུས་ཕྱེད་གནས་ཐོགས་ལྷགས།
en: Among the leaves, the upper bodies of the buddhas’ offspring are visible;

source: །བཏུད་ནས་ས་ཡི་སྙིང་པོར་མེ་ཏོག་རྣམས་ཀྱང་འཐོར།
en: They bow to the center of the world and scatter flowers.

source: །ཁ་ཅིག་པད་མ་ཨུད་པ་ལ་པད་མ་དཀར་པོ་རྒྱས།
en: Some arrive proffering ponds with blooming lotuses; They bring blue and white lotuses that have opened.

source: །པད་མའི་སྙིང་པོར་སུམ་ཅུ་རྩ་གཉིས་མཚན་ལྡན་གནས། །དེ་འདྲར་མེ་ཏོག་རྒྱས་པའི་རྫིང་བུ་ཐོགས་ཏེ་ལྷགས།
en: At the center of each of the flowers, there are beings endowed with the thirty-two marks,

source: །ཆགས་མེད་ཡིད་ལྡན་བྱང་ཆུབ་སེམས་དཔའ་མཁས་ལ་བསྟོད།
en: Who praise the learned Bodhisattva and his undefiled mind.

source: །ཁ་ཅིག་ལྷུན་པོ་ལྟ་བུར་ལུས་ཆེན་བསྒྱུར་ཏེ་ལྷགས།
en: Some arrive in bodies as big as the central mountain.

source: །བར་སྣང་གནས་ནས་རང་གི་ལུས་ཀྱང་རབ་ཏུ་འདོར།
en: Standing in midair, they cast off their bodies;

source: །བོར་མ་ཐག་ཏུ་མེ་ཏོག་ཕྲེང་བ་རྣམས་སུ་གྱུར།
en: Immediately they transform into fresh flower garlands,

source: །སྟོང་གསུམ་དག་གི་རྒྱལ་བའི་ཞིང་རྣམས་ཁེབས་པར་བྱེད།
en: And cover the realms of the victorious ones in all the trichiliocosm.

source: །ཁ་ཅིག་མིག་གཉིས་སྲེག་པའི་བསྐལ་པ་ལྟ་བུ་དང་། །དེ་བཞིན་ཆགས་པ་དང་ནི་འཇིག་པར་སྟོན་ཅིང་ལྷགས།
en: Some arrive with eyes blazing like the fire at the end of an eon, Showing the dissolution and the creation.

source: །དེ་དག་ལུས་ལས་ཆོས་ཀྱི་སྒོ་མོ་མང་གྲག་སྟེ། །དེ་དག་ཐོས་པས་སེམས་ཅན་ཁྲག་ཁྲིག་སྲེད་པ་སྤོང་།
en: From their bodies many Dharma gates are heard, Causing millions of beings to abandon craving.

source: །ཁ་ཅིག་མཆུ་ནི་བིམ་པ་འདྲ་ལ་བཞིན་མཛེས་ཤིང་།
en: Some arrive with lips as beautiful as the bimba fruit;

source: །ཁ་བཞིན་རྫོགས་ལ་མིའམ་ཅི་འདྲའི་སྒྲ་སྒྲོགས་ལྷགས།
en: Their perfect mouths speak with voices like the kinnaras.

source: །དོ་ཤལ་སྣ་ཚོགས་ལེགས་བརྒྱན་བུ་མོ་ཆས་པ་འདྲ།
en: They appear like maidens, well adorned with necklaces;

source: །དེ་ལ་ལྟ་བས་ལྷ་ཡི་ཚོགས་རྣམས་ངོམས་མི་འགྱུར།
en: The gods who view them cannot get enough.

source: །ཁ་ཅིག་རྡོ་རྗེ་ལྟ་བུར་མི་ཕྱེད་ལུས་ཅན་དེ།
en: Some arrive with indestructible, vajra-like bodies;

source: །རྐང་པས་འོག་གི་ཆུ་ཡི་ཕུང་པོ་འབོག་ཅིང་ལྷགས།
en: They wade through the waters below.

source: །ཉི་མ་འདྲ་ཞིང་ཟླ་ལྟར་བཞིན་རྒྱས་སྣང་བྱེད་ལ།
en: Some arrive with their faces like the sun or the full moon;

source: །འོད་བྱེད་ཉོན་མོངས་སྐྱོན་རྣམས་བཅོམ་པ་ཁ་ཅིག་ལྷགས།
en: Their rays of light and luster conquer the faults of disturbing emotions.

source: །ཁ་ཅིག་རིན་པོ་ཆེས་བརྒྱན་ལག་ན་རིན་ཆེན་ཐོགས། །ཞིང་མང་བྱེ་བ་སྟོང་དག་ཁེབས་པར་བྱེད་ཅིང་ལྷགས།
en: Some arrive adorned with precious stones, holding jewels in their hands; With these gems they cover billions of realms.

source: །སེམས་ཅན་མང་ལ་ཕན་དང་བདེ་དང་ཚིམ་བྱའི་ཕྱིར།
en: In order to benefit, delight, and satisfy many sentient beings,

source: །རིན་ཆེན་མེ་ཏོག་དམ་པ་དྲི་ཞིམ་ཆར་པ་འབེབས།
en: They bring down a rain of scented and perfect jewel flowers.

source: །ཁ་ཅིག་གཟུངས་ཆེན་རིན་པོ་ཆེ་ཡི་མཛོད་གྱུར་ཅིང་།
en: Some arrive with the treasury of the precious great dhāraṇīs;

source: །བ་སྤུ་རྣམས་ནས་མདོ་སྡེ་ཁྲག་ཁྲིག་རབ་བརྗོད་ལ།
en: From the pores in their skin, hundreds of thousands of sūtras are heard.

source: །སྤོབས་པར་ལྡན་ཞིང་བློ་གྲོས་ལྡན་ལ་བློ་མཆོག་ལྡན།
en: With their confidence, intelligence, and exalted minds,

source: །རྒྱགས་ཞིང་རབ་དྲེགས་སྐྱེ་བོ་རྟོགས་པར་བྱེད་ཅིང་ལྷགས།
en: They cause realization in all proud and haughty beings.

source: །ཁ་ཅིག་རི་བོ་ལྷུན་པོ་རྔ་ལྟར་ཐོགས་ནས་ནི།
en: Some arrive holding the central mountain like a drum;

source: །རབ་ཏུ་རྡུང་ཞིང་མཁའ་ལས་ཡིད་འོང་སྒྲ་འབྱིན་ལྷགས།
en: Beating it, they fill the sky with sweet voices.

source: །དེ་ཡི་སྒྲ་ནི་ཕྱོགས་བཅུར་བྱེ་བའི་ཞིང་སོང་སྟེ།
en: Their sound goes out to millions of realms everywhere:
